SW2-DELL#show openflow of-instance 1

Instance        : 1
Admin State     : Up
OF Version      : V1-3
Interface Type  : Port
DP Id           : 00:01:3c:2c:30:1c:cf:00
Forwarding Tbls : acl
Vlan Learn      : -
L2 MacLearn Mode: -
Flow map        : 
EchoReq interval: 15 seconds
Connect interval: 15 seconds
Number of Flows : 15 (acl:15)
Packets (acl)   : 5381
Bytes (acl)     : 572101
Fail mode       : secure
Flow misses     : copy-to-controller
Controller 1    : TCP, 10.10.254.1/6633, rcv/sndbuf 2000/32000, connected (equal)
Controller 2    : -
 Port List      : 
                  Gi 1/15 (67), Gi 1/16 (68), Gi 1/47 (99)
                  Gi 1/48 (100)
 Vlan List      :
                  
 Vlan Mbr list  :



SW2-DELL#show running-config
interface GigabitEthernet 1/15
 no ip address
 no shutdown
 of-instance 1
!
interface GigabitEthernet 1/16
 no ip address
 no shutdown
 of-instance 1
!
interface GigabitEthernet 1/17
 ip address 10.10.254.2/24
 no shutdown
!   
interface GigabitEthernet 1/47
 no ip address
 no shutdown
 of-instance 1
!
interface GigabitEthernet 1/48
 no ip address
 no shutdown
 of-instance 1
!
openflow of-instance 1
 controller 1 10.10.254.1 tcp  sndbuf 32000
 of-version 1.3
 no shutdown
!



SW1-DELL#show openflow of-instance 1

Instance        : 1
Admin State     : Up
OF Version      : V1-3
Interface Type  : Port
DP Id           : 00:01:3c:2c:30:1c:d7:00
Forwarding Tbls : acl
Vlan Learn      : -
L2 MacLearn Mode: -
Flow map        : 
EchoReq interval: 15 seconds
Connect interval: 15 seconds
Number of Flows : 11 (acl:11)
Packets (acl)   : 2491
Bytes (acl)     : 274853
Fail mode       : secure
Flow misses     : copy-to-controller
Controller 1    : TCP, 10.10.255.1/6633, rcv/sndbuf 2000/32000, connected (equal) 
Controller 2    : -
 Port List      : 
                  Gi 1/15 (67), Gi 1/16 (68), Gi 1/47 (99)

 Vlan List      :
                  
 Vlan Mbr list  :


SW1-DELL#show running-config
interface GigabitEthernet 1/15
 no ip address
 no shutdown
 of-instance 1
!
interface GigabitEthernet 1/16
 no ip address
 no shutdown
 of-instance 1
!
interface GigabitEthernet 1/17
 ip address 10.10.255.2/24
 no shutdown
!
interface GigabitEthernet 1/47
 no ip address
 no shutdown
 of-instance 1
!
openflow of-instance 1
 controller 1 10.10.255.1 tcp  sndbuf 32000
 interface-type any
 of-version 1.3
 no shutdown
!






SW3-ARUBA(of-inst-prueba)# show openflow instance prueba

 Configured OF Version         : 1.3 only  
 Negotiated OF Version         : 1.3  
 Instance Name                 : prueba                           
 Data-path Description         : prueba 
 Administrator Status          : Enabled 
 Member List                   : VLAN 3                                        
 Pipeline Model                : Standard Match      
 Listen Port                   : 6633           
 Operational Status            : Up      
 Operational Status Reason     : NA                                           
 Datapath ID                   : 0003f860f0adc800        
 Mode                          : Active    
 Flow Location                 : Hardware and Software         
 No. of Hardware Flows         : 2     
 No. of Software Flows         : 1     
 Hardware Rate Limit           : 0 kbps              
 Software Rate Limit           : 100 pps        
 Conn. Interrupt Mode          : Fail-Secure         
 Maximum Backoff Interval      : 60 seconds     
 Probe Interval                : 10 seconds     
 Hardware Table Miss Count     : NA                  
 No. of Software Flow Tables   : 1  
 Egress Only Ports             : None                                    
 Table Model                   : Policy Engine and Software                   
 Source MAC Group Table        : Disabled                                
 Destination MAC Group Table   : Disabled                                
 Default Miss Action           : Output-Normal       
 Packet-In VLAN Tagging        : Default             

 Controller Id Connection Status Connection State Secure Role  
 ------------- ----------------- ---------------- ------ ------
 1             Connected         Active           No     Equal 

SW3-ARUBA(of-inst-prueba)# show running-config
openflow
   controller-id 1 ip 10.10.253.1 controller-interface vlan 2
   instance "prueba"
      listen-port
      member vlan 3
      controller-id 1
      version 1.3 only
      default-miss-action output-normal
      enable
      exit
   enable
   exit
vlan 2
   name "VLAN2"
   untagged 23
   ip address 10.10.253.2 255.255.255.0
   exit
vlan 3
   name "VLAN3"
   untagged 1-2,24
   no ip address
   exit
